"use strict";

//1

// Створити розмітку з формою, що містить список (select) з трьома варіантами вибору: "Кава", "Чай" та "Сік". При виборі кожного варіанту виводити відповідне повідомлення в блок на сторінці.

let drinks = +prompt("Виберіть напій: : 1 - Кава, 2 - Чай, 3 - Сік");
switch (drinks) {
  case 1:
    alert("Ви вибрали каву");
    break;
  case 2:
    alert("Ви вибрали чай");
    break;
  case 3:
    alert("Ви вибрали сік");
    break;
  default:
    alert("Ви вибрали сік");
    break;
}

//2

// Створити розмітку з полем введення, що приймає рядок та кнопкою. При натисканні на кнопку перевіряти, чи введений рядок є днем тижня (наприклад: "понеділок", "вівторок" і т.д.), виводити відповідне повідомлення про робочий день або вихідний.

let day = prompt("Напішить день тижня");
switch (day) {
  case "Понеділок":
  case "Вівторок":
  case "Середа":
  case "Четвер":
  case "П'ятниця":
    alert("Це робочий день");
    break;
  case "Субота":
  case "Неділя":
    alert("Це вихідний день");
    break;
  default:
    alert("Введений рядок не є днем тижня");
    break;
}

//3

// Створити розмітку з полем введення, що приймає номер місяця та кнопкою. При натисканні на кнопку виводити повідомлення про пору року, до якої належить цей місяць.

let numberOfMonth = +prompt("Введіть номер місяця");
switch (numberOfMonth) {
  case 1:
  case 2:
  case 12:
    alert("Це зима");
    break;
  case 3:
  case 4:
  case 5:
    alert("Це весна");
    break;
  case 6:
  case 7:
  case 8:
    alert("Це літо");
    break;
  case 9:
  case 10:
  case 11:
    alert("Це осінь");
    break;

  default:
    alert("Введений рядок не є сезоном");

    break;
}

//4

// Створити розмітку з полем введення, що приймає номер місяця та кнопкою. При натисканні на кнопку виводити кількість днів у цьому місяці.

let daysInMonth = +prompt("Введіть номер місяця");
switch (daysInMonth) {
  case 1:
  case 3:
  case 5:
  case 7:
  case 8:
  case 10:
  case 12:
    alert("Цей місяць має 31 день");
    break;
  case 4:
  case 6:
  case 9:
  case 11:
    alert("Цей місяць має 30 днів");
    break;
  case 2:
    alert("Цей місяць має 29 днів");
    break;
  default:
    alert("Невідомий місяць");
    break;
}

// 5

// Створити розмітку з полем введення, що приймає назву кольору (наприклад, "червоний", "синій" і т.д.) та кнопкою. При натисканні на кнопку виводити відповідне повідомлення про дію: якщо це "червоний" — "стоп", якщо "зелений" — "йти", якщо "жовтий" — "чекати".

let colors = +prompt("Виберіть колір 1 - червоний, 2 - зелений, 3 - жовтий ");
switch (colors) {
  case 1:
    alert("стоп");
    break;
  case 2:
    alert("йти");
    break;
  case 3:
    alert("чекати");
    break;
  default:
    alert("Невідомий колір");
    break;
}


// 6 

// Створити розмітку з двома полями введення, що приймають числа та список (select) з варіантами вибору операцій: "+", "-", "*", "/". При натисканні на кнопку виводити результат обраної операції над цими числами. Користувач повинен бути попереджений про можливість ділення на нуль.

//?????
